app/Models/ModelPeminjaman.php

    public function getPeminjaman()
    {
        $builder = $this->db->table('tbl_peminjaman')
            ->join('tbl_pelanggan', 'id_pelanggan=id')
            ->join('tbl_mobil', 'id_mobil=id_mobil1');
        return $builder->get();
---
SELECT *
FROM `tbl_peminjaman`
JOIN `tbl_pelanggan` ON `id_pelanggan`=`id`
JOIN `tbl_mobil` ON `id_mobil`=`id_mobil1`

    public function getPelanggan()
    {
        $builder = $this->db->table('tbl_pelanggan');
        return $builder->get();
---
SELECT *
FROM `tbl_pelanggan`

    public function getMobil()
    {
        $builder = $this->db->table('tbl_mobil');
        return $builder->get();
---
SELECT *
FROM `tbl_mobil`