app/Models/ModelMobil.php

    public function getMobil()
    {
        $builder = $this->db->table('tbl_mobil');
        return $builder->get();
---
SELECT *
FROM `tbl_mobil`